[
  {
    "date": "01/25/2026",
    "time": "2238",
    "list": {
      "Mood": "exhausted but in the best way possible",
      "Tamagotchi": "none",
      "Current song": "Don't Stop Me Now - Queen",
      "Current fixations": "none",
      "Current studies": "none"
    },
    "paragraphs": [
      "Today is a snow day! School for the next two days is cancelled too, so I'm pretty hyped.",
      "I've been quite sluggish this weekend. I think the snow and cold weather has got me feeling quite down, and parkour class got cancelled. I'll use this time to prepare, energize, etc.. instead.",
      "I won't go too deep into detail, but today, using commission money kindly donated to me by <a href=\"https://3kh0.net\">Rowan</a>, I took a leap of faith to buy something that'll make me pretty damn happy for a long time. But I have to work on my commission now LOL."
    ]
  },
  {
    "date": "01/23/2026",
    "time": "1130",
    "list": {
      "Mood": "sleepy and jittery",
      "Tamagotchi": "none (dead D:)",
      "Current song": "Ready to Fly - Masayoshi Takanaka",
      "Current fixations": "Alto's Adventure",
      "Current studies": "none (still busy)"
    },
    "paragraphs": [
      "A lot of art assets I had to do got rescheduled to a few months in the future... a great weight has been lifted off my back, but it is only delayed to a future date.",
      "So now i will just work on getting as many finished pages on my website.",
      "Also renewed the bunnyguy.foo domain, just so broken links all around don't live forever. If you're still using that domain, please switch over to sundial.city! I won't be renewing it this year!"
    ]
  },
  {
    "date": "01/12/2026",
    "time": "0846",
    "list": {
      "Mood": "tired with sore thighs",
      "Tamagotchi": "RV3 Neon Stars - Pyonkotchi (Chedder)",
      "Current song": "Take Me Back - Ginger Root",
      "Current fixations": "Parkour (had my first class on 01/10/2026)",
      "Current studies": "none (busy)"
    },
    "paragraphs": [
      "I have many, many things to catch up on. Scholarship deadlines are approaching, and I've plenty of art assets I need to make before Feburary rolls over. But for now, I am just working on my website."
    ]
  }
]
